'use strict';

let a = [1, 2, 3, 4, 5];
const b = [1, 2, 3, 4, 5];

// Дан массив [1, 2, 3, 4, 5]. С помощью метода splice преобразуйте массив в [1, 4, 5].
a.splice(1, 2);
alert(a);
a = b.slice();

// Дан массив [1, 2, 3, 4, 5]. С помощью метода splice запишите в новый массив элементы [2, 3, 4].
const c = a.splice(1, 3);
alert(c);
a = b.slice();

// Дан массив [1, 2, 3, 4, 5]. С помощью метода splice сделайте из него массив [1, 2, 3, 'a', 'b', 'c', 4, 5].
a.splice(3, 0, 'a', 'b', 'c');
alert(a);
a = b.slice();

// Дан массив [1, 2, 3, 4, 5]. С помощью метода splice сделайте из него массив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].
a.splice(1, 0, 'a', 'b');
a.splice(-1, 0, 'c');
a.splice(a.length, 0, 'e');
alert(a);